{
  "about": "### About Me\n\nI'm **Guilherme Niclewicz**, a Senior Full Stack Developer with a passion for crafting robust and scalable software solutions. With over seven years of experience spanning backend, frontend, and cloud computing, I specialize in Python and JavaScript technologies. My work combines technical leadership, a problem-solving mindset, and a commitment to clean, efficient code.\n\nI hold a **Master's degree in Computational Mathematics**, which has sharpened my analytical and algorithmic skills. Throughout my career, I've led impactful projects, including modernizing e-commerce platforms, designing cloud architectures with AWS, and developing APIs and data workflows that drive business growth.\n\n#### Highlights of my expertise include:\n- **Backend Development:** Python (Django, FastAPI) and scalable API design.\n- **Frontend Development:** React, Next.js, and dynamic user interfaces.\n- **Cloud Computing:** AWS Lambda, RDS, S3, and container orchestration with Docker/Kubernetes.\n- **DevOps Practices:** CI/CD pipelines, infrastructure as code, and performance optimization.\n\nI thrive in cross-functional teams, bridging technical and business goals to deliver innovative solutions. Whether leading a team of developers, mentoring junior engineers, or exploring cutting-edge technologies, I bring energy, adaptability, and a relentless drive for improvement.\n\nWhen I'm not coding, you can find me practicing **Brazilian Jiu-Jitsu** (I'm a brown belt with over a decade of experience) or playing soccer. My life philosophy centers on continuous learning and tackling challenges with determination and creativity.\n\nLet's connect to build the future of technology together!",
  "experience": "### Experience\n\n#### **Principal Software Engineer**\n**Olist** | Feb 2022 – Present | Remote\n- Led and mentored a team of up to 20 developers across various engineering contexts, fostering growth and technical excellence.\n- Spearheaded the development of **\"Communicator,\"** a unified messaging platform, reducing delivery time from 20s to 2s and streamlining message handling for over 1 million daily notifications.\n- Migrated a legacy WordPress-based CMS to a **modern headless CMS (Strapi + Next.js),** improving load speed by 70% and cutting development time for new pages from weeks to days.\n- Architected scalable **AWS infrastructure** using Lambda, SQS, SNS, RDS, and ECS, achieving 99.99% uptime.\n- Implemented CI/CD pipelines with GitLab, reducing deployment cycles by 75%.\n\n---\n\n#### **Full Stack Developer**\n**ExxonMobil** | Dec 2020 – Feb 2022 | Curitiba, Brazil\n- Developed the **\"Entitlement Engine\"** to manage security access for over 100,000 employees and 7,000+ applications globally.\n- Integrated ServiceNow and IAM systems, streamlining workflows and improving access management efficiency.\n- Deployed scalable applications in **Azure Cloud** and OpenShift, ensuring a 99.9% uptime SLA.\n- Improved setup time for access management processes, reducing delays from days to minutes.\n\n---\n\n#### **Data Engineer**\n**Banco Bradesco** | Jan 2019 – Dec 2020 | São Paulo, Brazil\n- Designed and implemented **ETL workflows** using Spark and Hive, processing data for over 35 million clients.\n- Built real-time data ingestion microservices with Flask, reducing latency and improving processing times.\n- Contributed to Bradesco winning the **\"Most Innovative IT Award\"** in 2019 by optimizing data solutions.\n\n---\n\n#### **Research Assistant**\n**Universidade Federal do Paraná** | Jan 2017 – Dec 2019 | Curitiba, Brazil\n- Conducted computational mathematics research, publishing academic papers and mentoring students.\n- Developed Python and MATLAB solutions for solving complex numerical problems.\n\n---\n\n#### **Technology Trainee**\n**BIM Brasil** | Dec 2015 – Jan 2017 | Curitiba, Brazil\n- Automated civil engineering processes, reducing manual work by 40%.\n- Implemented **BIM solutions** to optimize project management and improve efficiency.",
  "projects": "### Projects\n\n#### **CMS Migration with NextJS and Strapi**\n- Migrated over 400 landing pages from a legacy WordPress system to a modern **NextJS + Strapi** architecture.\n- Improved site performance (Google PageSpeed score: E → A) and empowered marketing teams with a self-service CMS.\n\n---\n\n#### **Unified Messaging Platform (Communicator)**\n- Consolidated 20+ microservices into 2 core services, reducing message delivery time from 20s to 2s.\n- Centralized all customer notifications (email, SMS, WhatsApp, push) with a unified API interface.\n\n---\n\n#### **Entitlement Engine at ExxonMobil**\n- Built a policy store managing security access for 100,000 employees and 7,000+ applications.\n- Improved access workflows, reducing setup time from days to minutes, deployed across multiple regions globally.\n\n---\n\n#### **Lead Generation Crawler**\n- Developed a scalable lead generation tool using **proxy pools** and containerization.\n- Increased lead acquisition efficiency and mentored a team member into becoming a proficient developer.\n\n---\n\n#### **APIs for Leads and Sellers**\n- Built and integrated APIs with Salesforce, Pipedrive, and Google to centralize data and automate lead qualification.\n- Enhanced ad targeting with real-time data updates and improved onboarding for high-value clients.\n\n---\n\n#### **E-Commerce Platform Revamp**\n- Led the modernization of an e-commerce platform using **NextJS, Strapi, and AWS**, boosting SEO and reducing operational costs.\n- Centralized lead data and streamlined marketing operations with automated workflows."
} 